app/views/job_listing/partials/_job_filters.html.erb

    <span>(Hold Ctrl key to select multiple)</span>
    <%= select("job_listing", "department", JobListing.all.collect {|j| [ j.department, j.department ] }, { :include_blank => 'All'}, {:multiple => true, :size =>10 }) %>
---
SELECT "job_listings".* FROM "job_listings"