app/controllers/job_listing_controller.rb

  def index
    @departments = params.has_key?(:job_listing)? params[:job_listing][:department] : nil
    @job_listings = JobListing.filter(@departments).search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])
---
SELECT "job_listings".* FROM "job_listings" WHERE "job_listings"."department" IN ('Comm & Central Alarm Center') AND (title LIKE '%%') ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "job_listings" WHERE "job_listings"."department" IN ('Comm & Central Alarm Center') AND (title LIKE '%%')